Ell-i/Runtime/stm32/variants/stm32f4discovery/stm32f4discovery_gpio.cpp
/*
 * Copyright (c) 2013-2014 ELL-i co-operative.
 *
 * This file is part of ELL-i software.
 *
 * ELL-i software is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * ELL-i software is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with ELL-i software.  If not, see <http://www.gnu.org/licenses/>.
 */

/**
 * @author Lari Lehtomäki <lari@lehtomaki.fi>  2014
 */

#include <stm32f4discovery_gpio.h>

/*
 * Boot-time definitions for the STM32F4 series MCU GPIO registers.
 */

DEFINE_GPIO_INIT_RECORD(A);
DEFINE_GPIO_INIT_RECORD(B);
DEFINE_GPIO_INIT_RECORD(C);
DEFINE_GPIO_INIT_RECORD(D);
DEFINE_GPIO_INIT_RECORD(E);
DEFINE_GPIO_INIT_RECORD(F);
DEFINE_GPIO_INIT_RECORD(G);
DEFINE_GPIO_INIT_RECORD(H);
DEFINE_GPIO_INIT_RECORD(I); // Actually only 12 bits, but the SW doesn't care

/*
 * Boot-time definitions for the STM32F4 series MCU ports.
 *
 * These macros here generate SystemInitRecord structures to the
 * SYSTEM_INIT_SECTION linker section.  The boot time initialisation
 * code iterates the records from that section, initialising the MCU
 * peripheral ports accordingly.
 */

DEFINE_GPIO_PORT(A, GPIOA_INIT_DefaultRecords, GPIOA_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(B, GPIOB_INIT_DefaultRecords, GPIOB_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(C, GPIOC_INIT_DefaultRecords, GPIOC_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(D, GPIOD_INIT_DefaultRecords, GPIOD_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(E, GPIOE_INIT_DefaultRecords, GPIOE_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(F, GPIOF_INIT_DefaultRecords, GPIOF_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(G, GPIOG_INIT_DefaultRecords, GPIOG_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(H, GPIOH_INIT_DefaultRecords, GPIOH_INIT_AltFunctRecords);
DEFINE_GPIO_PORT(I, GPIOI_INIT_DefaultRecords, GPIOI_INIT_AltFunctRecords);
